mvc-architecture/mvc/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["title", "test"], ["content", "testestest"], ["created_at", "2022-03-29 01:07:26.476745"], ["updated_at", "2022-03-29 01:07:26.476745"]]