mvc-architecture/web-framework/app/controllers/items_controller.rb

INSERT INTO "items" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Nasi goreng"], ["price", "20.000"], ["created_at", "2022-06-27 08:16:03.445744"], ["updated_at", "2022-06-27 08:16:03.445744"]]
---
  def create
    Item.create(params.require(:item).permit(:name, :price))

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy