test-driven-development/rails-controller-tests/app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @food = Food.find(params[:id])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @food = Food.find(params[:id])

INSERT INTO "foods" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    food_params = params[:food]
    @food = Food.new(name: food_params[:name], description: food_params[:description], price: food_params[:price])

    if @food.valid?
      @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "foods" SET "name" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["name", "Kebab"], ["updated_at", "2022-04-13 17:42:47.284556"], ["id", 1]]
---
  def update
    food_params = params[:food]
    @food = Food.find(params[:id])
    @food.name = food_params[:name]

    if @food.valid?
      @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 1]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy